lkaldyne/MSP430-AlarmSystem/main.c
#include "main.h"
#include "driverlib/driverlib.h"
#include "hal_LCD.h"

/*
 * This project contains some code samples that may be useful.
 *
 */

char ADCState = 0; //Busy state of the ADC
int16_t ADCResult = 0; //Storage for the ADC conversion result
typedef struct
{
    int hours;
    int minutes;
    int seconds;
    char cSeconds[2];
    char cMinutes[2];
    char cHours[2];
} timer;

typedef struct
{
    timer armTime;
    timer disarmTime;
} room;

timer alarmTimer;

room rooms[4];

int alarmActive = 0;

int decrement_timer(timer *alarmTimer);

void main(void)
{
    int magnetState = 0; //Current button press state (to allow edge detection)
    int led_state = 0;
    /*alarmTimer.cHours[0] = '1';
    alarmTimer.cHours[1] = '1';
    alarmTimer.cMinutes[0] = '0';
    alarmTimer.cMinutes[1] = '0';
    alarmTimer.cSeconds[0] = '0';
    alarmTimer.cSeconds[1] = '0';*/
    int counter = 0;

    /*
     * Functions with two underscores in front are called compiler intrinsics.
     * They are documented in the compiler user guide, not the IDE or MCU guides.
     * They are a shortcut to insert some assembly code that is not really
     * expressible in plain C/C++. Google "MSP430 Optimizing C/C++ Compiler
     * v18.12.0.LTS" and search for the word "intrinsic" if you want to know
     * more.
     * */


    //Turn off interrupts during initialization
    __disable_interrupt();

    //Stop watchdog timer unless you plan on using it
    WDT_A_hold(WDT_A_BASE);

    // Initializations - see functions for more detail
    Init_GPIO();    //Sets all pins to output low as a default
    Init_PWM();     //Sets up a PWM output
    Init_ADC();     //Sets up the ADC to sample
    Init_Clock();   //Sets up the necessary system clocks
    Init_UART();    //Sets up an echo over a COM port
    Init_LCD();     //Sets up the LaunchPad LCD display

     /*
     * The MSP430 MCUs have a variety of low power modes. They can be almost
     * completely off and turn back on only when an interrupt occurs. You can
     * look up the power modes in the Family User Guide under the Power Management
     * Module (PMM) section. You can see the available API calls in the DriverLib
     * user guide, or see "pmm.h" in the driverlib directory. Unless you
     * purposefully want to play with the power modes, just leave this command in.
     */
    PMM_unlockLPM5(); //Disable the GPIO power-on default high-impedance mode to activate previously configured port settings

    //All done initializations - turn interrupts back on.
    __enable_interrupt();

    displayScrollText("GRP 11 DEMO");

    // Initialize RTC
    // Source = 32kHz crystal, divided by 1024
    RTCCTL = RTCSS__XT1CLK | RTCSR | RTCPS__1024 | RTCIE;
    RTCMOD = 32-1;

    __bis_SR_register(GIE);     // Enter LPM3, enable interrupt

    while(1) //Do this when you want an infinite loop of code
    {
        /*if (counter++ >= 550 && alarmActive) {
            alarmActive = decrement_timer(&alarmTimer);
            counter = 0;
        }*/
        showChar(alarmTimer.cHours[0],pos1);
        showChar(alarmTimer.cHours[1],pos2);
        showChar(alarmTimer.cMinutes[0],pos3);
        showChar(alarmTimer.cMinutes[1],pos4);
        showChar(alarmTimer.cSeconds[0],pos5);
        showChar(alarmTimer.cSeconds[1],pos6);

        //Buttons SW1 and SW2 are active low (1 until pressed, then 0)
        if ((GPIO_getInputPinValue(GPIO_PORT_P2, GPIO_PIN5) == 1) & (magnetState == 0)) //Look for rising edge
        {
            Timer_A_outputPWM(TIMER_A0_BASE, &param);   //Turn on PWM
            magnetState = 1;                //Capture new button state
        }
        if ((GPIO_getInputPinValue(GPIO_PORT_P2, GPIO_PIN5) == 0) & (magnetState == 1)) //Look for falling edge
        {
            Timer_A_stop(TIMER_A0_BASE);                //Shut off PWM signal
            magnetState = 0;                            //Capture new button state
        }

        //Start an ADC conversion (if it's not busy) in Single-Channel, Single Conversion Mode
        if (ADCState == 0)
        {
            if (ADCResult > 900) {
                led_state = 1;
            }
            else {
                led_state = 0;
            }
            ADCState = 1; //Set flag to indicate ADC is busy - ADC ISR (interrupt) will clear it
            ADC_startConversion(ADC_BASE, ADC_SINGLECHANNEL);
        }
        if (led_state) {
            GPIO_setOutputHighOnPin (GPIO_PORT_P2, GPIO_PIN7);
        }
        else {
            GPIO_setOutputLowOnPin (GPIO_PORT_P2, GPIO_PIN7);
        }
    }

    /*
     * You can use the following code if you plan on only using interrupts
     * to handle all your system events since you don't need any infinite loop of code.
     *
     * //Enter LPM0 - interrupts only
     * __bis_SR_register(LPM0_bits);
     * //For debugger to let it know that you meant for there to be no more code
     * __no_operation();
    */

}

int decrement_timer(timer *alarmTimer) {
//    sprintf(alarmTimer->cSeconds, "%ld", alarmTimer->seconds);
//    sprintf(alarmTimer->cMinutes, "%ld", alarmTimer->minutes);

    alarmTimer->cSeconds[1]++;

    if (alarmTimer->cSeconds[1] == ':') {
        alarmTimer->cSeconds[1] = '0';
        alarmTimer->cSeconds[0]++;
    }
    if (alarmTimer->cSeconds[0] == '6') {
        alarmTimer->cSeconds[0] = '0';
        alarmTimer->cMinutes[1]++;
    }
    if (alarmTimer->cMinutes[1] == ':') {
        alarmTimer->cMinutes[1] = '0';
        alarmTimer->cMinutes[0]++;
    }
    if (alarmTimer->cMinutes[0] == '6') {
        alarmTimer->cMinutes[0] = '0';
        alarmTimer->cHours[1]++;
    }
    if (alarmTimer->cHours[1] == ':') {
        alarmTimer->cHours[1] = '0';
        alarmTimer->cHours[0]++;
    }
    if (alarmTimer->cHours[0] == '2' && alarmTimer->cHours[1] == '4') {
        alarmTimer->cHours[0] = '0';
        alarmTimer->cHours[1] = '0';
        alarmTimer->cMinutes[0] = '0';
        alarmTimer->cMinutes[1] = '0';
        alarmTimer->cSeconds[0] = '0';
        alarmTimer->cSeconds[1] = '0';
    }
    return 1;
}

void Init_GPIO(void)
{
    // Set all GPIO pins to output low to prevent floating input and reduce power consumption
    GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P3, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P6, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P7, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);

    GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P3, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P5, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P6, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P7, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P8, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);

    //Set LaunchPad switches as inputs - they are active low, meaning '1' until pressed
    GPIO_setAsInputPinWithPullUpResistor(SW1_PORT, SW1_PIN);
    GPIO_setAsInputPinWithPullUpResistor(SW2_PORT, SW2_PIN);
    //GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P2, GPIO_PIN5);

    //Set LED1 and LED2 as outputs
    //GPIO_setAsOutputPin(LED1_PORT, LED1_PIN); //Comment if using UART
    GPIO_setAsOutputPin(LED2_PORT, LED2_PIN);
}

/* Clock System Initialization */
void Init_Clock(void)
{
    /*
     * The MSP430 has a number of different on-chip clocks. You can read about it in
     * the section of the Family User Guide regarding the Clock System ('cs.h' in the
     * driverlib).
     */

