lkaldyne/MSP430-AlarmSystem/main.c
    /*
     * On the LaunchPad, there is a 32.768 kHz crystal oscillator used as a
     * Real Time Clock (RTC). It is a quartz crystal connected to a circuit that
     * resonates it. Since the frequency is a power of two, you can use the signal
     * to drive a counter, and you know that the bits represent binary fractions
     * of one second. You can then have the RTC module throw an interrupt based
     * on a 'real time'. E.g., you could have your system sleep until every
     * 100 ms when it wakes up and checks the status of a sensor. Or, you could
     * sample the ADC once per second.
     */
    //Set P4.1 and P4.2 as Primary Module Function Input, XT_LF
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P4, GPIO_PIN1 + GPIO_PIN2, GPIO_PRIMARY_MODULE_FUNCTION);

    // Set external clock frequency to 32.768 KHz
    CS_setExternalClockSource(32768);
    // Set ACLK = XT1
    CS_initClockSignal(CS_ACLK, CS_XT1CLK_SELECT, CS_CLOCK_DIVIDER_1);
    // Initializes the XT1 crystal oscillator
    CS_turnOnXT1LF(CS_XT1_DRIVE_1);
    // Set SMCLK = DCO with frequency divider of 1
    CS_initClockSignal(CS_SMCLK, CS_DCOCLKDIV_SELECT, CS_CLOCK_DIVIDER_1);
    // Set MCLK = DCO with frequency divider of 1
    CS_initClockSignal(CS_MCLK, CS_DCOCLKDIV_SELECT, CS_CLOCK_DIVIDER_1);
}

unsigned int output = 0;
unsigned int timerCounter = 0;



/* UART Initialization */
void Init_UART(void)
{
    /* UART: It configures P1.0 and P1.1 to be connected internally to the
     * eSCSI module, which is a serial communications module, and places it
     * in UART mode. This let's you communicate with the PC via a software
     * COM port over the USB cable. You can use a console program, like PuTTY,
     * to type to your LaunchPad. The code in this sample just echos back
     * whatever character was received.
     */

    //Configure UART pins, which maps them to a COM port over the USB cable
    //Set P1.0 and P1.1 as Secondary Module Function Input.
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P1, GPIO_PIN1, GPIO_PRIMARY_MODULE_FUNCTION);
    GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P1, GPIO_PIN0, GPIO_PRIMARY_MODULE_FUNCTION);

    /*
     * UART Configuration Parameter. These are the configuration parameters to
     * make the eUSCI A UART module to operate with a 9600 baud rate. These
     * values were calculated using the online calculator that TI provides at:
     * http://software-dl.ti.com/msp430/msp430_public_sw/mcu/msp430/MSP430BaudRateConverter/index.html
     */

    //SMCLK = 1MHz, Baudrate = 9600
    //UCBRx = 6, UCBRFx = 8, UCBRSx = 17, UCOS16 = 1
    EUSCI_A_UART_initParam param = {0};
        param.selectClockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK;
        param.clockPrescalar    = 6;
        param.firstModReg       = 8;
        param.secondModReg      = 17;
        param.parity            = EUSCI_A_UART_NO_PARITY;
        param.msborLsbFirst     = EUSCI_A_UART_LSB_FIRST;
        param.numberofStopBits  = EUSCI_A_UART_ONE_STOP_BIT;
        param.uartMode          = EUSCI_A_UART_MODE;
        param.overSampling      = 1;

    if(STATUS_FAIL == EUSCI_A_UART_init(EUSCI_A0_BASE, &param))
    {
        return;
    }

    EUSCI_A_UART_enable(EUSCI_A0_BASE);

    EUSCI_A_UART_clearInterrupt(EUSCI_A0_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);

    // Enable EUSCI_A0 RX interrupt
    EUSCI_A_UART_enableInterrupt(EUSCI_A0_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);

    if(!output){
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'c');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'u');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        output = 1;
    }

}


/* EUSCI A0 UART ISR - Echoes data back to PC host */
#pragma vector=USCI_A0_VECTOR
__interrupt
void EUSCIA0_ISR(void)
{
    uint8_t RxStatus = EUSCI_A_UART_getInterruptStatus(EUSCI_A0_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG);

    EUSCI_A_UART_clearInterrupt(EUSCI_A0_BASE, RxStatus);

    if (RxStatus)
    {

        /*alarmTimer.cHours[0] = '1';
        alarmTimer.cHours[1] = '1';
        alarmTimer.cMinutes[0] = '0';
        alarmTimer.cMinutes[1] = '0';
        alarmTimer.cSeconds[0] = '0';
        alarmTimer.cSeconds[1] = '0';*/

        uint8_t value = EUSCI_A_UART_receiveData(EUSCI_A0_BASE);

        // Arm zone 1
        if(((char)value >= '0' && (char)value <= '9') && timerCounter < 2){
            alarmTimer.cHours[timerCounter] = (char)value;
            timerCounter++;
        }
        if((char)value == 'h' && timerCounter == 2){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 2 && timerCounter < 5)){
            alarmTimer.cMinutes[timerCounter - 3] = (char)value;
            timerCounter++;
        }
        if((char)value == 'm' && timerCounter == 5){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 5 && timerCounter < 8)){
            alarmTimer.cSeconds[timerCounter-6] = (char)value;
            timerCounter++;
        }
        if((char)value == 's' && timerCounter == 8){
            timerCounter++;
        }

        // Arm zone 1
        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 8 && timerCounter < 11)){
            rooms[0].armTime.cHours[timerCounter-9] = (char)value;
            timerCounter++;
        }
        if((char)value == 'h' && timerCounter == 11){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 11 && timerCounter < 14)){
            rooms[0].armTime.cMinutes[timerCounter-12] = (char)value;
            timerCounter++;
        }
        if((char)value == 'm' && timerCounter == 14){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 14 && timerCounter < 17)){
            rooms[0].armTime.cSeconds[timerCounter-15] = (char)value;
            timerCounter++;
        }
        if((char)value == 's' && timerCounter == 17){
            timerCounter++;
        }

