lkaldyne/MSP430-AlarmSystem/main.c
        // Disarm zone 1
        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 17 && timerCounter < 20)){
            rooms[0].disarmTime.cHours[timerCounter-18] = (char)value;
            timerCounter++;
        }
        if((char)value == 'h' && timerCounter == 20){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 20 && timerCounter < 23)){
            rooms[0].disarmTime.cMinutes[timerCounter-21] = (char)value;
            timerCounter++;
        }
        if((char)value == 'm' && timerCounter == 23){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 23 && timerCounter < 26)){
            rooms[0].disarmTime.cSeconds[timerCounter-24] = (char)value;
            timerCounter++;
        }
        if((char)value == 's' && timerCounter == 26){
            timerCounter++;
        }
        // Arm zone 2
        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 26 && timerCounter < 29)){
            rooms[1].armTime.cHours[timerCounter-27] = (char)value;
            timerCounter++;
        }
        if((char)value == 'h' && timerCounter == 29){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 29 && timerCounter < 32)){
            rooms[1].armTime.cMinutes[timerCounter-30] = (char)value;
            timerCounter++;
        }
        if((char)value == 'm' && timerCounter == 32){
            timerCounter++;
        }

        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 32 && timerCounter < 35)){
            rooms[1].armTime.cSeconds[timerCounter-33] = (char)value;
            timerCounter++;
        }
        if((char)value == 's' && timerCounter == 35){
            timerCounter++;
        }

        // Disarm zone 2
        if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 35 && timerCounter < 38)){
               rooms[1].disarmTime.cHours[timerCounter-36] = (char)value;
               timerCounter++;
           }
           if((char)value == 'h' && timerCounter == 38){
               timerCounter++;
           }

           if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 38 && timerCounter < 41)){
               rooms[1].disarmTime.cMinutes[timerCounter-39] = (char)value;
               timerCounter++;
           }
           if((char)value == 'm' && timerCounter == 41){
               timerCounter++;
           }

           if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 41 && timerCounter < 44)){
               rooms[1].disarmTime.cSeconds[timerCounter-42] = (char)value;
               timerCounter++;
           }
           if((char)value == 's' && timerCounter == 44){
               timerCounter++;
           }
          // Arm zone 3
          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 44 && timerCounter < 47)){
              rooms[2].armTime.cHours[timerCounter-45] = (char)value;
              timerCounter++;
          }
          if((char)value == 'h' && timerCounter == 47){
              timerCounter++;
          }

          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 47 && timerCounter < 50)){
              rooms[2].armTime.cMinutes[timerCounter-48] = (char)value;
              timerCounter++;
          }
          if((char)value == 'm' && timerCounter == 50){
              timerCounter++;
          }

          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 50 && timerCounter < 53)){
              rooms[2].armTime.cSeconds[timerCounter-51] = (char)value;
              timerCounter++;
          }
          if((char)value == 's' && timerCounter == 53){
              timerCounter++;
          }
          // Disarm zone 3
          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 53 && timerCounter < 56)){
             rooms[2].disarmTime.cHours[timerCounter-54] = (char)value;
             timerCounter++;
          }
          if((char)value == 'h' && timerCounter == 56){
              timerCounter++;
          }

          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 56 && timerCounter < 59)){
              rooms[2].disarmTime.cMinutes[timerCounter-57] = (char)value;
              timerCounter++;
          }
          if((char)value == 'm' && timerCounter == 59){
              timerCounter++;
          }

          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 59 && timerCounter < 62)){
              rooms[2].disarmTime.cSeconds[timerCounter-60] = (char)value;
              timerCounter++;
          }
          if((char)value == 's' && timerCounter == 62){
              timerCounter++;
          }
          // Arm zone 4
          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 62 && timerCounter < 65)){
              rooms[3].armTime.cHours[timerCounter-63] = (char)value;
              timerCounter++;
          }
          if((char)value == 'h' && timerCounter == 65){
              timerCounter++;
          }

          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 65 && timerCounter < 68)){
              rooms[3].armTime.cMinutes[timerCounter-66] = (char)value;
              timerCounter++;
          }
          if((char)value == 'm' && timerCounter == 68){
              timerCounter++;
          }

          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 68 && timerCounter < 71)){
              rooms[3].armTime.cSeconds[timerCounter-69] = (char)value;
              timerCounter++;
          }
          if((char)value == 's' && timerCounter == 71){
              timerCounter++;
          }
          // Disarm zone 4
          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 71 && timerCounter < 74)){
              rooms[3].disarmTime.cHours[timerCounter-72] = (char)value;
              timerCounter++;
          }
          if((char)value == 'h' && timerCounter == 74){
              timerCounter++;
          }

          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 74 && timerCounter < 77)){
              rooms[3].disarmTime.cMinutes[timerCounter-75] = (char)value;
              timerCounter++;
          }
          if((char)value == 'm' && timerCounter == 77){
              timerCounter++;
          }

