lkaldyne/MSP430-AlarmSystem/main.c
          if(((char)value >= '0' && (char)value <= '9') && (timerCounter > 77 && timerCounter < 80)){
              rooms[3].disarmTime.cSeconds[timerCounter-78] = (char)value;
              timerCounter++;
          }
          if((char)value == 's' && timerCounter == 80){
              timerCounter++;
              alarmActive = 1;
          }



        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, value);



        if((char)value == 's' && timerCounter == 9){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '1');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 18){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'd');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 's');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '1');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 27){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '2');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 36){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'd');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 's');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '2');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 45){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '3');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 54){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'd');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 's');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '3');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 63){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '4');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 72){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'E');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'd');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 's');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'a');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'i');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'z');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '4');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
        if((char)value == 's' && timerCounter == 81){
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'S');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'u');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'p');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, ' ');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'c');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'o');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'm');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'p');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'l');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 't');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, 'e');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\n');
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, '\r');
        }
    }
}

/* PWM Initialization */
void Init_PWM(void)
{
    /*
     * The internal timers (TIMER_A) can auto-generate a PWM signal without needing to
     * flip an output bit every cycle in software. The catch is that it limits which
     * pins you can use to output the signal, whereas manually flipping an output bit
     * means it can be on any GPIO. This function populates a data structure that tells
     * the API to use the timer as a hardware-generated PWM source.
     *
     */
    //Generate PWM - Timer runs in Up-Down mode
    param.clockSource           = TIMER_A_CLOCKSOURCE_SMCLK;
    param.clockSourceDivider    = TIMER_A_CLOCKSOURCE_DIVIDER_1;
    param.timerPeriod           = TIMER_A_PERIOD; //Defined in main.h
    param.compareRegister       = TIMER_A_CAPTURECOMPARE_REGISTER_1;
    param.compareOutputMode     = TIMER_A_OUTPUTMODE_RESET_SET;
    param.dutyCycle             = HIGH_COUNT; //Defined in main.h

    //PWM_PORT PWM_PIN (defined in main.h) as PWM output
    GPIO_setAsPeripheralModuleFunctionOutputPin(PWM_PORT, PWM_PIN, GPIO_PRIMARY_MODULE_FUNCTION);
}

void Init_ADC(void)
{
    /*
     * To use the ADC, you need to tell a physical pin to be an analog input instead
     * of a GPIO, then you need to tell the ADC to use that analog input. Defined
     * these in main.h for A9 on P8.1.
     */

    //Set ADC_IN to input direction
    GPIO_setAsPeripheralModuleFunctionInputPin(ADC_IN_PORT, ADC_IN_PIN, GPIO_PRIMARY_MODULE_FUNCTION);

    //Initialize the ADC Module
    /*
     * Base Address for the ADC Module
     * Use internal ADC bit as sample/hold signal to start conversion
     * USE MODOSC 5MHZ Digital Oscillator as clock source
     * Use default clock divider of 1
     */
    ADC_init(ADC_BASE,
             ADC_SAMPLEHOLDSOURCE_SC,
             ADC_CLOCKSOURCE_ADCOSC,
             ADC_CLOCKDIVIDER_1);

    ADC_enable(ADC_BASE);

    /*
     * Base Address for the ADC Module
     * Sample/hold for 16 clock cycles
     * Do not enable Multiple Sampling
     */
    ADC_setupSamplingTimer(ADC_BASE,
                           ADC_CYCLEHOLD_16_CYCLES,
                           ADC_MULTIPLESAMPLESDISABLE);

    //Configure Memory Buffer
    /*
     * Base Address for the ADC Module
     * Use input ADC_IN_CHANNEL
     * Use positive reference of AVcc
     * Use negative reference of AVss
     */
    ADC_configureMemory(ADC_BASE,
                        ADC_IN_CHANNEL,
                        ADC_VREFPOS_AVCC,
                        ADC_VREFNEG_AVSS);

    ADC_clearInterrupt(ADC_BASE,
                       ADC_COMPLETED_INTERRUPT);

    //Enable Memory Buffer interrupt
    ADC_enableInterrupt(ADC_BASE,
                        ADC_COMPLETED_INTERRUPT);
}

//ADC interrupt service routine
#pragma vector=ADC_VECTOR
__interrupt
void ADC_ISR(void)
{
    uint8_t ADCStatus = ADC_getInterruptStatus(ADC_BASE, ADC_COMPLETED_INTERRUPT_FLAG);

    ADC_clearInterrupt(ADC_BASE, ADCStatus);

    if (ADCStatus)
    {
        ADCState = 0; //Not busy anymore
        ADCResult = ADC_getResults(ADC_BASE);
    }
}

// RTC interrupt service routine
#pragma vector=RTC_VECTOR
__interrupt void RTC_ISR(void)
{
         if(RTCIV & RTCIV_RTCIF)    {                  // RTC Overflow
             if(alarmActive)
                 decrement_timer(&alarmTimer);
         }
}
